BryanEgbert/esp32_pet_bowl_cam/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include <AsyncTCP.h>
#include <ESPAsyncWebServer.h>
#include <HTTPClient.h>
#include <SPIFFS.h>
#include <FS.h>
#include <ArduinoJson.h>
#include <AsyncJson.h>
#include <FileHandler.hpp>
#include <Base64.h>
#include <ESP32Servo.h>
#include <Update.h>
#include <Preferences.h>

#include "credentials.hpp"
#include "freertos/FreeRTOS.h"
#include "esp_camera.h"
#include "esp_timer.h"
#include "time.h"

#define LED_BUILTIN     33

#define SERVO_PIN       14

#define Y2_GPIO_NUM     5
#define Y3_GPIO_NUM     18
#define Y4_GPIO_NUM     19
#define Y5_GPIO_NUM     21
#define Y6_GPIO_NUM     36
#define Y7_GPIO_NUM     39
#define Y8_GPIO_NUM     34
#define Y9_GPIO_NUM     35
#define XCLK_GPIO_NUM   0
#define PCLK_GPIO_NUM   22
#define VSYNC_GPIO_NUM  25
#define HREF_GPIO_NUM   23
#define SIOD_GPIO_NUM   26
#define SIOC_GPIO_NUM   27
#define PWDN_GPIO_NUM   32
#define RESET_GPIO_NUM  -1

#define PREF_OPEN_SERVO_IF_TIMEOUT_KEY  "openOnTimeout"
#define PREF_SERVO_OPEN_MS_KEY          "servoOpenMs"

#define PREF_WIFI_SSID_KEY "ssid"
#define PREF_WIFI_PASS_KEY "password"

#define PREF_AI_URL_KEY   "aiUrl"
#define PREF_MQTT_URL_KEY "mqttUrl"

#define PREF_TZ_KEY "tz"

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
SemaphoreHandle_t feedingScheduleMutex, 
                  urlFileMutex, 
                  tzFileMutex,
                  wifiFileMutex,
                  notifyFileMutex,
                  servoConfigMutex;

Servo servo;
FileHandler fileHandler(SPIFFS);

const char* ntpServer = "pool.ntp.org";

DynamicJsonDocument feedingScheduleDoc(384);
DynamicJsonDocument urlListDoc(192);
DynamicJsonDocument httpPredictionResponseDoc(192);
DynamicJsonDocument servoConfigDoc(96);
DynamicJsonDocument tzDoc(64);
DynamicJsonDocument wifiCredentialsDoc(128);
DynamicJsonDocument weightDoc(48);

const char* FEEDING_SCHEDULE_FILE_PATH = "/feeding_schedule.json";
const char* URL_LIST_FILE_PATH = "/url_list.json";
const char* TZ_FILE_PATH = "/timezone.json";
const char* WIFI_CRED_FILE_PATH = "/wifi_cred.json";
const char* NOTIFY_FILE_PATH = "/notify_config.json";
const char* SERVO_CONFIG_FILE_PATH = "/servo_config.json";

unsigned long currentMillis = 0;

Preferences preferences;

void openServo(int delayMs) {
  log_d("Opening servo");
  for (int pos = 0; pos <= 180; pos++) {
    servo.write(pos);
  }

  log_d("Done opening servo");
  delay(delayMs);

  log_d("Closing servo");
  for (int pos = 180; pos >= 0; pos--) {
    servo.write(pos);
  }
  log_d("Done closing servo");
}

void printScannedWifi() {
  int numNetworks = WiFi.scanNetworks();
  for (int i = 0; i < numNetworks; ++i) {
    Serial.print(WiFi.SSID(i));
    Serial.printf(" | (%4d) | [%2d]\n", WiFi.RSSI(i), WiFi.channel(i));
  }
}

void onEvent(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len) {
  if (type == WS_EVT_CONNECT) {
    client->printf("Hello client %u | There are currently %u client(s)\n", client->id(), ws.count());
  } else if(type == WS_EVT_DISCONNECT){
    log_d("ws[%s][%u] disconnect: %u\n", server->url(), client->id());
  } else if(type == WS_EVT_DATA) {
    AwsFrameInfo * info = (AwsFrameInfo*)arg;

    if(info->final && info->index == 0 && info->len == len) {
      log_d("ws[%s][%u] %s-message[%llu]: ", server->url(), client->id(), (info->opcode == WS_TEXT) ? "text":"binary", info->len);

      if (info->opcode == WS_TEXT) {
        data[len] = 0;
        if (String((char*)data) == String("request_image")) {
          camera_fb_t* fb = esp_camera_fb_get();
    
          client->binary(fb->buf, fb->len);
          esp_camera_fb_return(fb);
        }
      }
    }
  }
}

void WiFiEvent(WiFiEvent_t event) {
  switch(event) {
    case ARDUINO_EVENT_WIFI_AP_START:
      WiFi.softAPsetHostname("ESP32CAM_PetBowlCam");
      WiFi.softAPenableIpV6();

      // initArduinoOTA();
      // ArduinoOTA.setTimeout(2000);
      
      break;
    case ARDUINO_EVENT_WIFI_STA_CONNECTED:
      WiFi.enableIpV6();

      break;
    default:
      break;
  }
}

void initCamera() {
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = Y2_GPIO_NUM;
  config.pin_d1 = Y3_GPIO_NUM;
  config.pin_d2 = Y4_GPIO_NUM;
  config.pin_d3 = Y5_GPIO_NUM;
  config.pin_d4 = Y6_GPIO_NUM;
  config.pin_d5 = Y7_GPIO_NUM;
  config.pin_d6 = Y8_GPIO_NUM;
  config.pin_d7 = Y9_GPIO_NUM;
  config.pin_xclk = XCLK_GPIO_NUM;
  config.pin_pclk = PCLK_GPIO_NUM;
  config.pin_vsync = VSYNC_GPIO_NUM;
  config.pin_href = HREF_GPIO_NUM;
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
  config.pin_pwdn = PWDN_GPIO_NUM;
  config.pin_reset = RESET_GPIO_NUM;
  config.xclk_freq_hz = 2000000;
  config.pixel_format = PIXFORMAT_JPEG;
  config.grab_mode = CAMERA_GRAB_LATEST;
  config.fb_location = CAMERA_FB_IN_PSRAM;

  if (psramFound()) {
    config.frame_size = FRAMESIZE_UXGA;
    config.jpeg_quality = 10;
    config.fb_count = 2;
  } else {
    config.frame_size = FRAMESIZE_SVGA;
    config.jpeg_quality = 12;
    config.fb_count = 1;
  }

  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    Serial.printf("Camera init failed with error 0x%x", err);
    ESP.restart();
  }

  sensor_t* sensor = esp_camera_sensor_get();
  if (sensor->id.PID == OV3660_PID) {
    sensor->set_vflip(sensor, 1);
    sensor->set_brightness(sensor, 1);
    sensor->set_saturation(sensor, -2);
  }
  sensor->set_framesize(sensor, FRAMESIZE_240X240);
}

void initServo() {
  ESP32PWM::allocateTimer(0);
	ESP32PWM::allocateTimer(1);
	ESP32PWM::allocateTimer(2);
	ESP32PWM::allocateTimer(3);
  servo.setPeriodHertz(50);
  servo.attach(SERVO_PIN, 1000, 2000);
}

void initTimezone() {
  configTime(0, 0, ntpServer);
  setenv("TZ", tzDoc["tz"].as<const char*>(), 1);
  tzset();
}

void initMutex() {
  feedingScheduleMutex = xSemaphoreCreateMutex();
  urlFileMutex = xSemaphoreCreateMutex();
  tzFileMutex = xSemaphoreCreateMutex();
  wifiFileMutex = xSemaphoreCreateMutex();
  notifyFileMutex = xSemaphoreCreateMutex();
  servoConfigMutex = xSemaphoreCreateMutex();


  if (feedingScheduleMutex == nullptr || 
      urlFileMutex == nullptr         || 
      tzFileMutex == nullptr          ||
      wifiFileMutex == nullptr        ||
      notifyFileMutex == nullptr      ||
      servoConfigMutex == nullptr) {
    log_e("Error initializing mutex, restarting...");
    ESP.restart();
  }
}

void listDir() {
  File root = SPIFFS.open("/");
  if(!root){
      Serial.println("- failed to open directory");
      return;
  }
  if(!root.isDirectory()){
      Serial.println(" - not a directory");
      return;
  }

  File file = root.openNextFile();
  while(file){
    if(file.isDirectory()){
        Serial.print("  DIR : ");
        Serial.println(file.name());
    } else {
        Serial.print("  FILE: ");
        Serial.print(file.name());
        Serial.print("\tSIZE: ");
        Serial.println(file.size());
    }
    file = root.openNextFile();
  }
}

/* TODO: Add json file to store
*   - Weight sensor value to notify through MQTT
*   - Handle ai server output
*   - Use Preferences library to store simple key value data
*/
void setup() {

