BryanEgbert/esp32_pet_bowl_cam/src/main.cpp
  Serial.begin(115200);

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW);

  initServo();
  initMutex();

  preferences.begin("app", false);
  
  if (!SPIFFS.begin(true)) {
    Serial.println("Error mounting spiffs");
    return;
  }

  if (!SPIFFS.exists(FEEDING_SCHEDULE_FILE_PATH)) {
    if (!fileHandler.createFile(FEEDING_SCHEDULE_FILE_PATH)) {
      log_e("Failed to create file content");
      return;
    }

    JsonArray feedingScheduleObj = feedingScheduleDoc.to<JsonArray>();

    if (!fileHandler.writeJson(FEEDING_SCHEDULE_FILE_PATH, feedingScheduleObj)) {
      log_e("Failed to write to file");
      return;
    }
  }

  if (!fileHandler.readJson(FEEDING_SCHEDULE_FILE_PATH, feedingScheduleDoc)) {
    log_e("Failed to read file content");
    return;
  }

  if (!SPIFFS.exists(URL_LIST_FILE_PATH)) {
    if (!fileHandler.createFile(URL_LIST_FILE_PATH)) {
      log_e("Failed to create file content");
      return;
    }

    JsonObject urlListObj = urlListDoc.to<JsonObject>();
    urlListObj["aiUrl"] = "";
    urlListObj["mqttUrl"] = "";

    if (!fileHandler.writeJson(URL_LIST_FILE_PATH, urlListObj)) {
      log_e("Failed to write to file");
      return;
    }
  }

  if (!fileHandler.readJson(URL_LIST_FILE_PATH, urlListDoc)) {
    log_e("Failed to read url file");
    return;
  }

  if (!SPIFFS.exists(TZ_FILE_PATH)) {
    if (!fileHandler.createFile(TZ_FILE_PATH)) {
      log_e("Failed to create file content");
      return;
    }

    JsonObject tzObj = tzDoc.to<JsonObject>();
    tzObj["tz"] = "UTC0";

    if (!fileHandler.writeJson(TZ_FILE_PATH, tzObj)) {
      log_e("Failed to write to file");
      return;
    }
  }

  if (!fileHandler.readJson(TZ_FILE_PATH, tzDoc)) {
    log_e("Failed to read url file");
    return;
  }

  if (!SPIFFS.exists(WIFI_CRED_FILE_PATH)) {
    if (!fileHandler.createFile(WIFI_CRED_FILE_PATH)) {
      log_e("Failed to create file content");
      return;
    }

    JsonObject wifiObj = wifiCredentialsDoc.to<JsonObject>();
    wifiObj["ssid"] = "";
    wifiObj["password"] = "";

    if (!fileHandler.writeJson(WIFI_CRED_FILE_PATH, wifiObj)) {
      log_e("Failed to write to file");
      return;
    }
  }

  if (!fileHandler.readJson(WIFI_CRED_FILE_PATH, wifiCredentialsDoc)) {
    log_e("Failed to read url file");
    return;
  }

  if (!SPIFFS.exists(NOTIFY_FILE_PATH)) {
    if (!fileHandler.createFile(NOTIFY_FILE_PATH)) {
      log_e("Failed to create file content");
      return;
    }

    JsonObject weightObj = weightDoc.to<JsonObject>();
    weightObj["weightToNotify"] = 0;

    if (!fileHandler.writeJson(NOTIFY_FILE_PATH, weightObj)) {
      log_e("Failed to write to file");
      return;
    }
  }

  if (!fileHandler.readJson(NOTIFY_FILE_PATH, weightDoc)) {
    log_e("Failed to read url file");
    return;
  }

  if (!SPIFFS.exists(SERVO_CONFIG_FILE_PATH)) {
    if (!fileHandler.createFile(SERVO_CONFIG_FILE_PATH)) {
      log_e("Failed to create file content");
      return;
    }

    JsonObject servoConfigObj = servoConfigDoc.to<JsonObject>();
    servoConfigDoc["servoOpenMs"] = 0;
    servoConfigDoc["shouldOpenIfTimeout"] = true;

    if (!fileHandler.writeJson(SERVO_CONFIG_FILE_PATH, servoConfigDoc)) {
      log_e("Failed to write to file");
      return;
    }
  }

  if (!fileHandler.readJson(SERVO_CONFIG_FILE_PATH, servoConfigDoc)) {
    log_e("Failed to read url file");
    return;
  }

  listDir();
  psramInit();

  byte* psdRamBuffer = (byte*)ps_malloc(1024 * 1024 * 4);

  // Init Camera
  initCamera();

  if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
    log_d("not enough space");
  }

  // Init WiFi
  WiFi.mode(WIFI_AP_STA);
  WiFi.onEvent(WiFiEvent);
  WiFi.softAP(AP_SSID, AP_PASS);

  if (wifiCredentialsDoc["ssid"].as<String>() != "" && wifiCredentialsDoc.containsKey("password")) {
    WiFi.begin(wifiCredentialsDoc["ssid"].as<const char*>(), wifiCredentialsDoc["password"].as<const char*>());
  }

  // Init server
  // server.on("/photo", HTTP_GET, [](AsyncWebServerRequest *request) {
  //   camera_fb_t* fb = esp_camera_fb_get();

  //   if (!fb) {
  //     request->send(500, "text/plain", "failed to capture photo\n");
  //     return;
  //   }

  //   // request->send(200, "text/jpeg", );
  //   AsyncWebServerResponse *response = request->beginResponse_P(200, "image/jpeg", (const uint8_t*)fb->buf, fb->len);
  //   // response->addHeader("Content-Encoding", "gzip");
  //   response->addHeader("Content-Disposition", "inline");
  //   response->addHeader("Access-Control-Allow-Origin", "*");
  //   esp_camera_fb_return(fb);

  //   request->send(response);
  // });

  server.on("/url", HTTP_GET, [](AsyncWebServerRequest* request) {
    // request->send(SPIFFS, URL_LIST_FILE_PATH, "application/json");
    char buffer[200];
    snprintf(buffer, 200, "{\"%s\":\"%s\",\"%s\":\"%s\"}", 
      PREF_AI_URL_KEY, 
      preferences.getString(PREF_AI_URL_KEY, "").c_str(), 
      PREF_MQTT_URL_KEY,
      preferences.getString(PREF_MQTT_URL_KEY, "").c_str());

    request->send(200, "application/json", buffer);
  });

  AsyncCallbackJsonWebHandler* urlListPostHandler = 
    new AsyncCallbackJsonWebHandler("/url", [](AsyncWebServerRequest* request, JsonVariant &json) {
  
    if (!json.containsKey("aiUrl") || !json.containsKey("mqttUrl")) {
      request->send(400, "application/json", "{\"message\": \"missing url field\"}");
      return;
    }

    if (xSemaphoreTake(urlFileMutex, portMAX_DELAY) != pdTRUE) {
      request->send(500, "text/plain", "max client allowed");

      return; 
    }

    // FileHandler fileHandler(SPIFFS);

    // if(!fileHandler.readJson(URL_LIST_FILE_PATH, urlListDoc)) {
    //   request->send(500, "application/json", "{\"message\": \"failed reading a file\"}");
    //   xSemaphoreGive(urlFileMutex);

    //   return;
    // }

    // urlListDoc["aiUrl"] = json["aiUrl"].as<const char*>();
    // urlListDoc["mqttUrl"] = json["mqttUrl"].as<const char*>();

    // if (!fileHandler.writeJson(URL_LIST_FILE_PATH, urlListDoc)) {
      // request->send(500, "application/json", "{\"message\": \"failed opening a file\"}\n");
      // xSemaphoreGive(urlFileMutex);

      // return;
    // }

    if (preferences.putString(PREF_AI_URL_KEY, json["aiUrl"].as<const char*>()) == 0  ||
        preferences.putString(PREF_MQTT_URL_KEY, json["mqttUrl"].as<const char*>()) == 0) {

      request->send(500, "application/json", "{\"message\": \"failed to store data\"}\n");
      xSemaphoreGive(urlFileMutex);

      return;
    }

