BryanEgbert/esp32_pet_bowl_cam/src/main.cpp
    if (xSemaphoreTake(wifiFileMutex, portMAX_DELAY) != pdTRUE) {
      request->send(500, "text/plain", "internal server error");

      return;
    }

    AsyncWebParameter* ssidParam = request->getParam("ssid", true);
    AsyncWebParameter* passwordParam = request->getParam("password", true);

    if (preferences.putString(PREF_WIFI_SSID_KEY, ssidParam->value()) == 0 || preferences.putString(PREF_WIFI_PASS_KEY, passwordParam->value()) == 0) {
      request->send(500, "application/json", "{\"message\": \"failed to store data\"}\n");
      xSemaphoreGive(wifiFileMutex);

      return;
    }

    // if (preferences.putString(PREF_WIFI_PASS_KEY, passwordParam->value()) == 0) {
    //   request->send(500, "application/json", "{\"message\": \"failed to store password\"}\n");
    //   xSemaphoreGive(wifiFileMutex);

    //   return;
    // }

    request->send(204);
    vTaskDelay(1000);

    WiFi.begin(wifiCredentialsDoc["ssid"].as<const char*>(), wifiCredentialsDoc["password"].as<const char*>());
    xSemaphoreGive(wifiFileMutex);
  });

  AsyncCallbackJsonWebHandler* wifiPostHandler = 
    new AsyncCallbackJsonWebHandler("/wifi", [](AsyncWebServerRequest* request, JsonVariant &json) {
    if (json.is<JsonArray>()) {
      request->send(400, "application/json", "{\"message\": \"invalid request\"}\n");
      return;
    }

    if (xSemaphoreTake(wifiFileMutex, portMAX_DELAY) != pdTRUE) {
      request->send(500, "text/plain", "internal server error");

      return;
    }

    if (!json.containsKey("ssid")) {
      request->send(400, "application/json", "{\"message\": \"missing ssid field\"}\n");
      xSemaphoreGive(wifiFileMutex);      

      return;
    }

    // FileHandler fileHandler(SPIFFS);

    // if(!fileHandler.readJson(WIFI_CRED_FILE_PATH, wifiCredentialsDoc)) {
    //   request->send(500, "application/json", "{\"message\": \"failed reading a file\"}");
    //   xSemaphoreGive(wifiFileMutex);

    //   return;
    // }

    // wifiCredentialsDoc["ssid"] = json["ssid"];
    // if (json.containsKey("password"))
    //   wifiCredentialsDoc["password"] = json["password"];
    
    // if (!fileHandler.writeJson(WIFI_CRED_FILE_PATH, wifiCredentialsDoc)) {
      // request->send(500, "application/json", "{\"message\": \"failed opening a file\"}\n");
      // xSemaphoreGive(wifiFileMutex);

      // return;
    // }

    if (preferences.putString(PREF_WIFI_SSID_KEY, json["ssid"].as<const char*>()) == 0) {
      request->send(500, "application/json", "{\"message\": \"failed to store ssid\"}\n");
      xSemaphoreGive(wifiFileMutex);

      return;
    }

    if (json.containsKey("password"))
      if (preferences.putString(PREF_WIFI_PASS_KEY, json["password"].as<const char*>()) == 0) {
        request->send(500, "application/json", "{\"message\": \"failed to store password\"}\n");
        xSemaphoreGive(wifiFileMutex);
  
        return;
      }


    request->send(204);
    WiFi.begin(wifiCredentialsDoc["ssid"].as<const char*>(), wifiCredentialsDoc["password"].as<const char*>());
    xSemaphoreGive(wifiFileMutex);
  });

  // server.on("/notify/setting", HTTP_GET, [](AsyncWebServerRequest* request) {
  //   request->send(SPIFFS, NOTIFY_FILE_PATH, "application/json");
  // });

  // server.on("/notify/setting", HTTP_POST, [](AsyncWebServerRequest* request) {
  //   if (!request->hasParam("weightToNotify", true)) {
  //     request->send(400, "application/json", "{\"message\": \"missing tz field\"}");
  //     return;
  //   }

  //   if (xSemaphoreTake(notifyFileMutex, portMAX_DELAY) != pdTRUE) {
  //     request->send(500, "text/plain", "internal server error");;

  //     return;
  //   }

  //   FileHandler fileHandler(SPIFFS);

  //   if (!fileHandler.readJson(NOTIFY_FILE_PATH, weightDoc)){
  //     request->send(500, "application/json", "{\"message\": \"failed reading a file\"}");
  //     xSemaphoreGive(notifyFileMutex);

  //     return;
  //   }

  //   AsyncWebParameter* weightToNotifyParam = request->getParam("weightToNotify", true);
  //   long weightToNotify = weightToNotifyParam->value().toInt();
  //   if (weightToNotify < 0) {
  //     request->send(400, "application/json", "{\"message\": \"value must be a positive number\"}");
  //     xSemaphoreGive(notifyFileMutex);

  //     return;
  //   }

  //   weightDoc["weightToNotify"] = weightToNotify;

  //   if (!fileHandler.writeJson(NOTIFY_FILE_PATH, weightDoc)) {
  //     request->send(500, "application/json", "{\"message\": \"failed writing to a file\"}");
  //     xSemaphoreGive(notifyFileMutex);

  //     return;
  //   }

  //   request->send(204);
  //   xSemaphoreGive(notifyFileMutex);
  // });

  server.on("/servo/open", HTTP_POST, [](AsyncWebServerRequest* request) {
    if (xSemaphoreTake(servoConfigMutex, portMAX_DELAY) != pdTRUE) {
      request->send(500, "application/json", "{\"message\": \"servo is in use by the esp32\"}");

      return;
    }

    if (!fileHandler.readJson(SERVO_CONFIG_FILE_PATH, servoConfigDoc)) {
      request->send(500, "application/json", "{\"message\": \"failed to read from file\"}");
      xSemaphoreGive(servoConfigMutex);

      return;
    }

    // unsigned int delayMs = servoConfigDoc["servoOpenMs"].as<unsigned int>();

    openServo(servoConfigDoc["servoOpenMs"].as<int>());

    request->send(200, "application/json", "{\"message\": \"success\"}");
    xSemaphoreGive(servoConfigMutex);
  });

  server.on("/servo", HTTP_GET, [](AsyncWebServerRequest* request) {
    // request->send(SPIFFS, SERVO_CONFIG_FILE_PATH, "application/json");
    char buffer[60];
    snprintf(buffer, 60, "{\"%s\":%s,\"%s\":%d}", 
      PREF_OPEN_SERVO_IF_TIMEOUT_KEY, 
      preferences.getBool(PREF_OPEN_SERVO_IF_TIMEOUT_KEY, true) ? "true" : "false",
      PREF_SERVO_OPEN_MS_KEY,
      preferences.getUInt(PREF_SERVO_OPEN_MS_KEY, 0)
    );

    request->send(200, "application/json", buffer);
  });

  server.on("/servo", HTTP_POST, [](AsyncWebServerRequest* request) {
    if (!request->hasParam("shouldOpenIfTimeout", true) || !request->hasParam("servoOpenMs", true)) {
      request->send(400, "application/json", "{\"message\": \"missing required field\"}");
      return;
    }

    if (xSemaphoreTake(servoConfigMutex, portMAX_DELAY) != pdTRUE) {
      request->send(500, "text/plain", "internal server error");

      return;
    }

    // FileHandler fileHandler(SPIFFS);

    // if (!fileHandler.readJson(SERVO_CONFIG_FILE_PATH, servoConfigDoc)){
    //   request->send(500, "application/json", "{\"message\": \"failed reading a file\"}");
    //   xSemaphoreGive(servoConfigMutex);

    //   return;
    // }

    AsyncWebParameter* shouldOpenIfTimeoutParam = request->getParam("shouldOpenIfTimeout", true);
    AsyncWebParameter* servoOpenMsParam = request->getParam("servoOpenMs", true);

