BryanEgbert/esp32_pet_bowl_cam/src/main.cpp
    if (shouldOpenIfTimeoutParam->value() != "true" && shouldOpenIfTimeoutParam->value() != "false" ) {
      request->send(400, "application/json", "{\"message\": \"shouldOpenIfTimeout param should be either true or false\"}");
      xSemaphoreGive(servoConfigMutex);

      return;
    }

    bool shouldOpenIfTimeout = (shouldOpenIfTimeoutParam->value() == "true") ? true : false;
    long servoOpenMs = servoOpenMsParam->value().toInt();
    if (servoOpenMs < 0) {
      request->send(400, "application/json", "{\"message\": \"servoOpenMs parameter value should be a positive number\"}");
      xSemaphoreGive(servoConfigMutex);

      return;
    }

    // servoConfigDoc["shouldOpenIfTimeout"] = shouldOpenIfTimeout;
    // servoConfigDoc["servoOpenMs"] = servoOpenMs;

    // if (!fileHandler.writeJson(SERVO_CONFIG_FILE_PATH, servoConfigDoc)) {
      // request->send(500, "application/json", "{\"message\": \"failed writing to a file\"}");
      // xSemaphoreGive(servoConfigMutex);

      // return;
    // }
    // preferences.putBool(PREF_OPEN_SERVO_IF_TIMEOUT_KEY, shouldOpenIfTimeout);
    // preferences.putInt(PREF_SERVO_OPEN_MS_KEY, servoOpenMs);
    if (preferences.putBool(PREF_OPEN_SERVO_IF_TIMEOUT_KEY, shouldOpenIfTimeout) == 0 ||
        preferences.putUInt(PREF_SERVO_OPEN_MS_KEY, servoOpenMs) == 0) {

      request->send(500, "application/json", "{\"message\": \"failed to store data\"}");
      xSemaphoreGive(servoConfigMutex);

      return;
    }

    request->send(204);
    xSemaphoreGive(servoConfigMutex);
  });

  server.on("/update", HTTP_POST, [](AsyncWebServerRequest* request) {
    AsyncWebServerResponse *response = request->beginResponse((Update.hasError()) ? 400 : 200, "text/plain", Update.hasError() ? String(Update.getError()).c_str() : "OK");
    response->addHeader("Connection", "close");
    response->addHeader("Access-Control-Allow-Origin", "*");

    request->send(response);

  }, [](AsyncWebServerRequest *request, const String& filename, size_t index, uint8_t *data, size_t len, bool final) {
    log_d("Handling file upload, filename = %s | index = %d | len = %d | final = %d", filename, index, len, final);
    if(len){
      if (Update.write(data, len) != len) {
        return request->send(400, "text/plain", "Failed to write chunked data to free space");
      }
    }
        
    if (final) {
      if (!Update.end(true)) {
        log_d("/update: %s", String(Update.getError()));
      }

      log_i("Update successfully completed. Please reboot your device");
    }else{
      return;
    }
  });

  server.on("/reset", HTTP_POST, [](AsyncWebServerRequest* request) {
    request->send(204);
    ESP.restart();
  });

  ws.onEvent(onEvent);

  server.addHandler(&ws);
  server.addHandler(feedingSchedulePostHandler);
  server.addHandler(urlListPostHandler);
  // server.addHandler(wifiPostHandler);

  server.begin();

  initTimezone();

  while (WiFi.status() != WL_CONNECTED) {
    log_i("Could not connect to wifi, waiting for wifi connection");
    delay(3000);
  }

  digitalWrite(LED_BUILTIN, HIGH);

  log_d("test update upload");
}

void loop() {
  struct tm timeinfo;

  if (WiFi.status() != WL_CONNECTED) return;

  if(!getLocalTime(&timeinfo)){
    log_w("Failed to fetch local time");
    return;
  }

  if (xSemaphoreGetMutexHolder(feedingScheduleMutex) != nullptr || 
      xSemaphoreGetMutexHolder(urlFileMutex) != nullptr         ||
      xSemaphoreGetMutexHolder(tzFileMutex) != nullptr          || 
      xSemaphoreGetMutexHolder(wifiFileMutex) != nullptr        ||
      xSemaphoreGetMutexHolder(servoConfigMutex) != nullptr) {
      
    return;
  }

  // if (!fileHandler.readJson(FEEDING_SCHEDULE_FILE_PATH, feedingScheduleDoc)) {
  //   log_e("Failed reading feeding schedule file");
  //   return;
  // }

  // if (!fileHandler.readJson(URL_LIST_FILE_PATH, urlListDoc)) {
  //   log_e("Failed reading url file");
  //   return;
  // }

  // if (!fileHandler.readJson(SERVO_CONFIG_FILE_PATH, servoConfigDoc)) {
  //   log_e("Failed reading servo configuration file");
  //   return;
  // }

  JsonArray arrDoc = feedingScheduleDoc.as<JsonArray>();
  for (JsonVariant v : arrDoc) {
    if (v["hour"].as<int>() != timeinfo.tm_hour   || 
        v["minutes"].as<int>() != timeinfo.tm_min ||
        (millis() - currentMillis < 60000 && currentMillis != 0)) {
          continue;
    }

    log_i("Time matched: %d:%d| %d:%d", 
      v["hour"].as<int>(), 
      v["minutes"].as<int>(), 
      timeinfo.tm_hour, 
      timeinfo.tm_min
    );

    digitalWrite(LED_BUILTIN, LOW);

    String url = preferences.getString(PREF_AI_URL_KEY, "");
    if (url == nullptr || url == "") {
      log_w("AI URL is empty");          
      return;
    }

    camera_fb_t* fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Failed at getting camera framebuffer");
      continue;
    }


    int encodedLength = Base64.encodedLength(fb->len);
    log_d("Length: %d", encodedLength);

    char* encodedString = (char*)malloc(encodedLength * sizeof(char) + 1);
    Base64.encode(encodedString, reinterpret_cast<char*>(fb->buf), fb->len);

    esp_camera_fb_return(fb);
    log_d("Deallocate camera framebuffer");

    String reqBody = "--camBoundary\r\nContent-Disposition: form-data; name=\"file_base64\"\r\n\r\n";
    reqBody += encodedString;
    reqBody += "\r\n--camBoundary--\r\n";

    free(encodedString);
    log_d("Successfully deallocate base64 variable");

    log_d("start request");

    int retries = 0;
    HTTPClient http;

    int httpCode = 0;

    http.begin(url.c_str());

    http.addHeader("Content-Type", "multipart/form-data; boundary=camBoundary");
    http.addHeader("Content-Length", String(reqBody.length()));
    http.addHeader("accept", "application/json");

    do {
      http.setTimeout(10000);
      http.useHTTP10(false);
      http.setReuse(false);

      httpCode = http.POST(reqBody);

      log_d("Status code: %d", httpCode);

      retries++;
    } while (retries <= 5 && httpCode != HTTP_CODE_OK);

    digitalWrite(LED_BUILTIN, HIGH);


    if (retries <= 5) {
      log_d("Getting response body");
      String payload = http.getString();

      deserializeJson(httpPredictionResponseDoc, payload);

      String responseOutput = "";
      serializeJson(httpPredictionResponseDoc, responseOutput);
      responseOutput += '\n';

      log_d("response: %s", responseOutput.c_str());

      ws.textAll(responseOutput.c_str());
      String topPrediction = httpPredictionResponseDoc["top"].as<String>();

      if (topPrediction == "unfinished_bowl" || topPrediction == "empty_bowl") {
        digitalWrite(LED_BUILTIN, LOW);

        openServo(preferences.getUInt(PREF_SERVO_OPEN_MS_KEY, 0));

        digitalWrite(LED_BUILTIN, HIGH);
      } else if (topPrediction == "floor") {
        log_d("prediction is floor, ignoring");
      }
    } else {
      if (preferences.getBool(PREF_OPEN_SERVO_IF_TIMEOUT_KEY, true)) {
        ws.textAll("Failed to send payload");
        
        digitalWrite(LED_BUILTIN, LOW);
        openServo(preferences.getUInt(PREF_SERVO_OPEN_MS_KEY, 0));
        digitalWrite(LED_BUILTIN, HIGH);
      }
    }

    http.end();
    log_d("HTTPClient end() called");

    currentMillis = millis();
  }
}
